#include <iostream>
#include <conio.h> 
#include <time.h>
#include "SDL.h"
#include "SDL_image.h"
#include <cstdlib>
#define LEN 4			//蛇的初始长度为4
#define BLOCK_W 50		//块宽
#define BLOCK_H 50		//块长
//下面定义了矩阵中各值代表的意义
#define SPACE 0					//可供蛇走动的空间
#define WALL 1					//墙
#define BLOCK 2					//构成蛇身体的一块
#define FOOD 3					//食物

typedef enum direction {UP=0,DOWN,LEFT,RIGHT}direction;		//蛇的当前方向

//这个矩阵实际就是游戏中每一帧都需要绘制的东西，这个地图的横纵坐标轴在矩阵的左上角
const int map[12][20]={{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
					   {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
				   	   {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
				       {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
				       {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
				       {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
			           {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
				       {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
				       {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
				       {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
				       {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
				       {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}};
//定义蛇身体一部分的坐标
typedef struct block{
	int x;
	int y;
	struct block* next;
}block;
//食物在矩阵中的位置也要特别保存起来			
typedef struct Food		
{
	int x;
	int y;
}Food;